In [2]:
import sqlite3

conn=sqlite3.connect('my_database.db')

In [3]:
cur=conn.cursor()

In [4]:
cur.execute('''
CREATE TABLE IF NOT EXISTS students(
            id INTEGER PRIMARY KEY AUTOINCREMENT,
            name TEXT NOT NULL,
            age INTEGER,
            grade TEXT)
            
            
            
            ''')
conn.commit()

In [5]:
cur.execute(
    'INSERT INTO students(name,age,grade) VALUES(?,?,?)',
    ('Alice',14,'9th')
)
conn.commit()

Adding multiple student

In [6]:
students_to_add = [
    ('Bob',   15, '10th'),
    ('Clara', 13, '8th'),
    ('Dan',   14, '9th'),
]
cur.executemany(
    'INSERT INTO students (name, age, grade) VALUES (?, ?, ?)',
    students_to_add
)
conn.commit()

FETCH ALL ROWS

In [7]:
cur.execute('SELECT * FROM students')
rows=cur.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 15, '10')
(2, 'Bob', 16, '10th')
(3, 'Clara', 14, '8th')
(5, 'Alice', 14, '9th')
(6, 'Bob', 15, '10th')
(7, 'Clara', 13, '8th')
(8, 'Dan', 14, '9th')

In [8]:
cur.execute('SELECT * FROM students WHERE name=?',('Alice',))
row=cur.fetchone()
print(row)

(1, 'Alice', 15, '10')

In [9]:
for row in cur.execute('SELECT id, name FROM students'):
    print(row)

(1, 'Alice')
(2, 'Bob')
(3, 'Clara')
(5, 'Alice')
(6, 'Bob')
(7, 'Clara')
(8, 'Dan')

Updating Data

In [10]:
cur.execute(
    'UPDATE students SET grade=? WHERE name =?',
    ('10','Alice')
)
conn.commit()

In [11]:
for x in cur.execute('SELECT * FROM students'):
    print(x)

(1, 'Alice', 15, '10')
(2, 'Bob', 16, '10th')
(3, 'Clara', 14, '8th')
(5, 'Alice', 14, '10')
(6, 'Bob', 15, '10th')
(7, 'Clara', 13, '8th')
(8, 'Dan', 14, '9th')

In [12]:
cur.execute('DELETE FROM students WHERE name=?',('Dan',))
conn.commit()

In [13]:
try:
    conn.execute('BEGIN')
    cur.execute('UPDATE students SET age = age + 1')
    # More operations...
    conn.commit()
except sqlite3.Error as e:
    print('Error occurred:', e)
    conn.rollback()

In [14]:
conn.row_factory = sqlite3.Row
cur = conn.cursor()

cur.execute('SELECT * FROM students')
rows = cur.fetchall()
for row in rows:
    print(row['name'],row['age'])

Alice 16
Bob 17
Clara 15
Alice 15
Bob 16
Clara 14

In [15]:
import sqlite3
conn=sqlite3.connect('my_database.db')
cur  = conn.cursor()


cur.execute('SELECT id, name, age FROM students')
rows = cur.fetchall()

for row in rows:
    # row is a tuple: (id, name, age)
    print(row[0], row[1], row[2])

1 Alice 16
2 Bob 17
3 Clara 15
5 Alice 15
6 Bob 16
7 Clara 14

In [16]:

# Enable named-column access
conn.row_factory = sqlite3.Row
cur = conn.cursor()

cur.execute('SELECT id, name, age FROM students')
rows = cur.fetchall()

for row in rows:
    # row behaves like a dict *and* a tuple
    print(row['id'], row['name'], row['age'])
    print(row[0],row[1],row[2])

1 Alice 16
1 Alice 16
2 Bob 17
2 Bob 17
3 Clara 15
3 Clara 15
5 Alice 15
5 Alice 15
6 Bob 16
6 Bob 16
7 Clara 14
7 Clara 14

In [17]:
#cur.close()
#conn.close()

In [18]:
cur.execute("SELECT * FROM students ORDER BY name")
a=[dict(x) for x in cur.fetchall()]

In [19]:
a

[{'id': 1, 'name': 'Alice', 'age': 16, 'grade': '10'},
 {'id': 5, 'name': 'Alice', 'age': 15, 'grade': '10'},
 {'id': 2, 'name': 'Bob', 'age': 17, 'grade': '10th'},
 {'id': 6, 'name': 'Bob', 'age': 16, 'grade': '10th'},
 {'id': 3, 'name': 'Clara', 'age': 15, 'grade': '8th'},
 {'id': 7, 'name': 'Clara', 'age': 14, 'grade': '8th'}]

In [22]:
cur.execute("SELECT * FROM students ORDER BY name")
rows=cur.fetchall()
for row in rows:
    print(dict(row))

{'id': 1, 'name': 'Alice', 'age': 16, 'grade': '10'}
{'id': 5, 'name': 'Alice', 'age': 15, 'grade': '10'}
{'id': 2, 'name': 'Bob', 'age': 17, 'grade': '10th'}
{'id': 6, 'name': 'Bob', 'age': 16, 'grade': '10th'}
{'id': 3, 'name': 'Clara', 'age': 15, 'grade': '8th'}
{'id': 7, 'name': 'Clara', 'age': 14, 'grade': '8th'}